call_print_code_: procedure(full);

declare make_example_code_ entry(dimension(0:511) fixed binary(9),
				 dimension(0:511) bit(20) varying);
declare print_code_ entry(bit(1),
			  dimension(0:511) fixed binary(9),
			  dimension(0:511) bit(20) varying);

declare full bit(1);

declare codes(0:511) bit(20) varying;
declare order(0:511) fixed binary(9);

call make_example_code_(order, codes);
call print_code_(full, order, codes);

end call_print_code_;
