call_compress_: procedure;

%include compress_;
%include write_into_;

declare c12345$(15) bit(9) external static;
declare test_fz$ bit(9*(5 + 1) + 5*5 + 4 + 5*2 + 4*2 + 3*2 + 2*3 + 1*3)
     external static;
declare compress_fatal condition;

on compress_fatal goto finished;

call write_into_(addr(test_fz$), write, "call_compress_", "test_fz");

write: procedure returns(fixed binary(24));
   return(compress_(c12345$, test_fz$, 0));
end;

finished:
end call_compress_;
