/* -*- indent-tabs-mode: nil -*- */
call_read_header_: procedure(full);

%include print_header_;

declare full bit(1);

declare example_header$ bit(512*9 + 512*4 + 4) external static;

call print_header_(example_header$, full);

end call_read_header_;
