call_print_counts: procedure;

declare print_counts_ entry(dimension(0:511) fixed binary(20));

declare counts(0:511) fixed binary(20) initial((512) 0);
declare i fixed binary(9);

do i = 1 to 5;
  counts(i + 15) = i;
end;

call print_counts_(counts);

end call_print_counts;
