call_count_bytes: procedure;

declare c12345$(15) bit(9) external static;

declare count_bytes_
     entry(dimension(*) bit(9)) returns(dimension(0:511) fixed binary(35));
declare print_counts_ entry(dimension(0:511) fixed binary(35));

call print_counts_(count_bytes_(c12345$));

end call_count_bytes;
