/* -*- indent-tabs-mode: nil -*- */
call_count_bytes_: procedure;

/* This procedure calls count_bytes_ with input from "c12345" (15
   characters). */

%include count_bytes_;
%include print_counts_;

declare c12345$(15) bit(9) external static;

call print_counts_(count_bytes_(c12345$));

end call_count_bytes_;
