/* -*- indent-tabs-mode: nil -*- */
print_counts_: procedure(counts);

/* This procedure prints the given array as a series of index: value pairs, one
   per line. */

%include external;

/* The array to be printed. */
declare counts(0:511) fixed binary(35);

declare i fixed binary(10);

do i = lbound(counts, 1) to hbound(counts, 1);
   call ioa_("^d: ^d", i, counts(i));
end;

end print_counts_;
